In [1]:
import pandas as pd
import numpy as np

Importando

In [3]:
df = pd.read_csv('exemplo', sep=',')

In [5]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
df = df + 1

In [12]:
df

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

exportando

In [15]:
df.to_csv("exemplo.csv", sep=';', decimal=',')

In [22]:
df = pd.read_excel('Exemplo_Excel.xlsx', sheet_name='Sheet1')

In [24]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [26]:
df.to_excel("exemplo.xlsx", sheet_name='Sheet1')

Arquivos HTML

In [29]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [31]:
type(df)

list

In [33]:
len(df)

1

In [43]:
df[0]['Bank Name']

0    Republic First Bank dba Republic Bank
1                            Citizens Bank
2                 Heartland Tri-State Bank
3                      First Republic Bank
4                           Signature Bank
5                      Silicon Valley Bank
6                        Almena State Bank
7               First City Bank of Florida
8                     The First State Bank
9                       Ericson State Bank
Name: Bank Name, dtype: object